#pragma once

/***********************************************
* マクロ定義
***********************************************/

/***********************************************
* 型定義
***********************************************/

/***********************************************
* プロトタイプ宣言
***********************************************/
int block_intialze(void);		//初期化処理
int block_Update(void);			//更新処理
int block_Draw(void);			//描画処理

int Get_GenarateFlg(void);		//ブロックの生成判定処理
int Get_Line(void);				//消したラインの数取得処理